# 6.1 Reading and Writing Data in Text Format
Reason : convert text to pandas data frame

**Indexing**

Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, arguments you provide, or not at all.

**Type inference and data conversion**

Includes the user-defined value conversions and custom list of missing value markers.

**Date and time parsing**

Includes a combining capability, including combining date and time information spread over multiple columns into a single column in the result.

**Iterating**

Support for iterating over chunks of very large files.

**Unclean data issues**

Includes skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("examples/ex1.csv")

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
!cat examples/ex2.csv # if row does not have a header row

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
df2 = pd.read_csv("examples/ex2.csv", header=None)

In [7]:
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv("examples/ex2.csv", names=["a","b","c","d","message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names=["a","b","c","d","message"]
pd.read_csv("examples/ex2.csv", names = names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [11]:
parsed = pd.read_csv("examples/csv_mindex.csv", index_col=["key1", "key2"])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
!cat examples/ex3.txt

A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
result = pd.read_csv("examples/ex3.txt", sep="\s+")

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [17]:
pd.read_csv("examples/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
result = pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [22]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [23]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [24]:
result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False, na_values=["Na"])

In [25]:
result3

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [26]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [27]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [28]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
pd.read_csv("examples/ex5.csv",na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [29]:
pd.options.display.max_rows = 10

In [30]:
npArr = np.random.standard_normal((1000,4))
keys = np.random.choice(list("ABCDEFGHIJKLMNO"), size=1000)
result = np.column_stack((npArr, keys))

In [31]:
np.savetxt("examples/ex6.csv", result, delimiter=",", fmt="%s", header="one,two,three,four,key",comments="")

In [32]:
df = pd.read_csv("examples/ex6.csv")

In [33]:
df_styled = df.style.format({
    'one': "{:.2f}",
    'two': "{:.2f}",
    'three': "{:.2f}",
    'four': "{:.2f}",
    "key": lambda x : x.upper()
})

In [34]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [35]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [36]:
df.head(10)

        one       two     three      four key
0  2.031846 -1.136850 -0.711257 -0.197115   J
1 -0.856436  1.343934 -0.522451 -1.294916   H
2 -1.452291 -1.056228  1.863241 -0.813649   N
3 -1.356013 -1.267249 -0.283976  1.532943   H
4 -1.760532 -1.708217  0.195946 -0.841403   M
5  0.293804  0.162877  1.071171  0.741089   N
6 -0.617521  0.707421  0.432970 -0.433014   B
7 -1.002469 -0.594470  0.308894  1.285693   G
8  0.362814 -0.968138 -0.732446  0.334210   D
9 -1.802234 -0.181333 -0.118304 -1.641964   A

In [37]:
data = pd.read_csv("examples/ex5.csv")

In [38]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
data.to_csv("examples/out.csv")

In [40]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [41]:
import sys

data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [42]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [43]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [44]:
data.to_csv(sys.stdout, index=False, columns=["a","b","c"], na_rep="NULL")

a,b,c
1,2,3.0
5,6,NULL
9,10,11.0

In [45]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [46]:
import csv

f = open("examples/ex7.csv")

In [47]:
reader = csv.reader(f)

In [48]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [49]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [50]:
header, values = line[0], lines[1:]

In [51]:
data_dict = {h: v for h, v in zip(header, zip(header, *values))}

In [52]:
data_dict

{'1': ('1', '1', '1')}

In [53]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [54]:
f = open("examples/ex7.csv")
reader = csv.reader(f, dialect=my_dialect)

## JSON Data
JSON (short for JavaScript Object Notation) has become one of the standard formats for sending data by HTTP request between web browsers and other applications. It is a much more free-form data format than a tabular text form like CSV. Here is an example:

In [55]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
""" # JSON file

In [56]:
import json

In [57]:
result = json.loads(obj)

In [58]:
print(type(result), result)

<class 'dict'> {'name': 'Wes', 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'], 'pet': None, 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']}, {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [59]:
asjson = json.dumps(result)

In [60]:
type(asjson)

str

In [61]:
siblings = pd.DataFrame(result["siblings"], columns=["name","age"])

In [62]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [63]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [64]:
data = pd.read_json("examples/example.json")

In [65]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [66]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [69]:
import sqlite3

In [71]:
query = query = """ CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),c REAL, d INTEGER);"""
con = sqlite3.connect("mydata.sqlite")

In [72]:
con.execute(query)

In [73]:
con.commit()

In [74]:
data = [("Atlanta", "Georgia", 1.25, 6), ("Tallahassee", "Florida", 2.6, 3),("Sacramento", "California", 1.7, 5)]

stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [75]:
con.executemany(stmt, data)

In [76]:
con.commit()

In [77]:
cursor = con.execute("select * from test")

In [78]:
rows = cursor.fetchall()

In [79]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [80]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [91]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5